In [166]:
from pandas import DataFrame
from pandas import Series
import pandas as pd
data = {"name":["yahoo","google","facebook","sina","baidu"], "marks":["200","400","800","200", "abc"], "price":[5, 1, 7,1,5]} 
f1 = DataFrame(data)

In [161]:
s = Series([True,True,True,True,True])

In [162]:
f1

  marks      name  price
0   200     yahoo      5
1   400    google      1
2   800  facebook      7
3   200      sina      1
4   abc     baidu      5

In [170]:
f1['marks'] = pd.to_numeric(f1['marks'], errors='coerce')
f1['marks'].fillna(0.0)

0    200.0
1    400.0
2    800.0
3    200.0
4      0.0
Name: marks, dtype: float64

In [169]:
f1

   marks      name  price
0  200.0     yahoo      5
1  400.0    google      1
2  800.0  facebook      7
3  200.0      sina      1
4    NaN     baidu      5

In [136]:
def cal_distance(row, marks):
    return row.marks - marks

In [132]:
f1['distance'] = f1.apply(lambda row : cal_distance(row, 200), axis=1)

TypeError: ("unsupported operand type(s) for -: 'str' and 'int'", 'occurred at index 0')

In [138]:
f2 = f1.groupby(['name']).mean().reset_index()

In [139]:
f2

       name  price
0     baidu      5
1  facebook      7
2    google      3
3      sina      1
4     yahoo      9

In [130]:
f1.groupby(['marks','name']).mean().reset_index()

  marks      name  price
0   200      sina      1
1   500     baidu      5
2   800  facebook      7
3   200     yahoo      9
4   400    google      3

In [131]:
f1.marks.unique()

array(['200', '400', 800, 200, 500], dtype=object)